# Feature Scaling:

In [1]:
#1. Normalizaion
#2. Standardization

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
data_set = pd.read_csv("feature_scaling.csv")
data_set

   country  age  salary purchase
0   france   44   72000       no
1    spain   27   49000      yes
2    india   30   58000       no
3  germany   38   61000       no
4    spain   40   70000      yes
5    india   35   50000       no
6   france   31   52000      yes
7  germany   45   63000      yes
8    spain   50   67000      yes

In [5]:
x = data_set.iloc[:,1:3]
x

   age  salary
0   44   72000
1   27   49000
2   30   58000
3   38   61000
4   40   70000
5   35   50000
6   31   52000
7   45   63000
8   50   67000

# MinMaxScaler:

In [6]:
from sklearn.preprocessing import MinMaxScaler

In [7]:
mms = MinMaxScaler(feature_range=(0, 1))

# tranforming x now:

In [8]:
x_after_minmax = mms.fit_transform(x)

In [9]:
x_after_minmax

array([[0.73913043, 1.        ],
       [0.        , 0.        ],
       [0.13043478, 0.39130435],
       [0.47826087, 0.52173913],
       [0.56521739, 0.91304348],
       [0.34782609, 0.04347826],
       [0.17391304, 0.13043478],
       [0.7826087 , 0.60869565],
       [1.        , 0.7826087 ]])

# Standardization:

In [10]:
from sklearn.preprocessing import StandardScaler

In [11]:
standard = StandardScaler()

# Tranforming the X for standardization:

In [12]:
x_after_standard = standard.fit_transform(x)

In [13]:
x_after_standard

array([[ 0.85598498,  1.45273648],
       [-1.48268826, -1.38421117],
       [-1.06998122, -0.27410122],
       [ 0.03057089,  0.09593543],
       [ 0.30570892,  1.20604538],
       [-0.38213615, -1.26086562],
       [-0.93241221, -1.01417452],
       [ 0.99355399,  0.34262653],
       [ 1.68139906,  0.83600873]])